ncw/public/session-02.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-24 Wed 13:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Session 02</title>
<meta name="generator" content="Org mode">
<meta name="author" content="ii friend">
<link rel='stylesheet' href='aesthetic/main.css' />
</head>
<body>
<article id="content">
<header>
<h1 class="title">Session 02</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org48e24e8">1. Introduction</a></li>
<li><a href="#org5120e99">2. Agenda</a></li>
<li><a href="#org08eafc9">3. Make</a>
<ul>
<li><a href="#orge3badb8">3.1. What it is</a></li>
<li><a href="#org02311e0">3.2. Ensuring you have it on your computer</a></li>
<li><a href="#org9f9266b">3.3. How we use it</a></li>
</ul>
</li>
<li><a href="#org70e9936">4. The CMD Folder</a>
<ul>
<li><a href="#org90000a1">4.1. Where to find it</a></li>
<li><a href="#orgc54c7a6">4.2. What it is</a></li>
</ul>
</li>
<li><a href="#org8ab2713">5. Making in Parts</a></li>
<li><a href="#org097f5e1">6. Verify Dev envrionment ready to go</a>
<ul>
<li><a href="#orgec62153">6.1. Have Docker</a></li>
<li><a href="#org7de1ca2">6.2. Have git</a></li>
<li><a href="#org264173d">6.3. Have Go</a></li>
<li><a href="#orge055c61">6.4. Fork of k8s cloned to dev environment</a></li>
</ul>
</li>
<li><a href="#org20f850e">7. Run a make command</a>
<ul>
<li><a href="#org03a1bfc">7.1. cd into k8s from yr terminal</a></li>
<li><a href="#org49fd59d">7.2. make WHAT=cmd/kubectl</a></li>
</ul>
</li>
<li><a href="#org8d49927">8. Make a KinD Cluster</a>
<ul>
<li><a href="#org9a9474e">8.1. What is kind?</a></li>
<li><a href="#org03284b0">8.2. Install Kind</a></li>
<li><a href="#org75ea454">8.3. kind create cluster</a></li>
</ul>
</li>
<li><a href="#org8b8905b">9. Use newly-built kubectl binary in the KinD cluster</a></li>
<li><a href="#org8afd02b">10. Additional Help</a></li>
<li><a href="#org4daecf1">11. What&rsquo;s Next?</a></li>
</ul>
</div>
</nav>

<section id="outline-container-org48e24e8" class="outline-2">
<h2 id="org48e24e8"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>In this Session we will introduce you to the make command and kubernetes cmd folder.</li>
<li>You&rsquo;ll also learn about KinD (kubernetes in docker)</li>
<li><p>
We&rsquo;ll learn more about how k8s buid process works
</p>

<p>
By the end, you will edit and build a kubernetes command that you can run on your own kind cluster!
<b><b>This session continues on Session 1.  If you haven&rsquo;t done that one yet, do it first!</b></b>
</p></li>
</ul>
</div>
</section>
<section id="outline-container-org5120e99" class="outline-2">
<h2 id="org5120e99"><span class="section-number-2">2</span> Agenda</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Intro to make</li>
<li>Intro to CMD</li>
<li>The Build Process</li>
<li>Intro to KinD</li>
<li>Editing and Building</li>
<li>Running our command on KinD</li>
</ul>
</div>
</section>
<section id="outline-container-org08eafc9" class="outline-2">
<h2 id="org08eafc9"><span class="section-number-2">3</span> Make</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge3badb8" class="outline-3">
<h3 id="orge3badb8"><span class="section-number-3">3.1</span> What it is</h3>
</div>
<div id="outline-container-org02311e0" class="outline-3">
<h3 id="org02311e0"><span class="section-number-3">3.2</span> Ensuring you have it on your computer</h3>
</div>
<div id="outline-container-org9f9266b" class="outline-3">
<h3 id="org9f9266b"><span class="section-number-3">3.3</span> How we use it</h3>
</div>
</section>
<section id="outline-container-org70e9936" class="outline-2">
<h2 id="org70e9936"><span class="section-number-2">4</span> The CMD Folder</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org90000a1" class="outline-3">
<h3 id="org90000a1"><span class="section-number-3">4.1</span> Where to find it</h3>
</div>
<div id="outline-container-orgc54c7a6" class="outline-3">
<h3 id="orgc54c7a6"><span class="section-number-3">4.2</span> What it is</h3>
</div>
</section>
<section id="outline-container-org8ab2713" class="outline-2">
<h2 id="org8ab2713"><span class="section-number-2">5</span> Making in Parts</h2>
<div class="outline-text-2" id="text-5">
<p>
Why do we not make all of kubernetes (no don&rsquo;t run make release)
What do we make in isolation?
</p>
</div>
</section>
<section id="outline-container-org097f5e1" class="outline-2">
<h2 id="org097f5e1"><span class="section-number-2">6</span> Verify Dev envrionment ready to go</h2>
<div class="outline-text-2" id="text-6">
<p>
<i>if needed, include instructions for each type of OS</i>
</p>
</div>
<div id="outline-container-orgec62153" class="outline-3">
<h3 id="orgec62153"><span class="section-number-3">6.1</span> Have Docker</h3>
</div>
<div id="outline-container-org7de1ca2" class="outline-3">
<h3 id="org7de1ca2"><span class="section-number-3">6.2</span> Have git</h3>
</div>
<div id="outline-container-org264173d" class="outline-3">
<h3 id="org264173d"><span class="section-number-3">6.3</span> Have Go</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<ol class="org-ol">
<li><a id="orgb5931c9"></a>GOPATH set<br></li>
</ol>
</div>
<div id="outline-container-orge055c61" class="outline-3">
<h3 id="orge055c61"><span class="section-number-3">6.4</span> Fork of k8s cloned to dev environment</h3>
</div>
</section>
<section id="outline-container-org20f850e" class="outline-2">
<h2 id="org20f850e"><span class="section-number-2">7</span> Run a make command</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org03a1bfc" class="outline-3">
<h3 id="org03a1bfc"><span class="section-number-3">7.1</span> cd into k8s from yr terminal</h3>
</div>
<div id="outline-container-org49fd59d" class="outline-3">
<h3 id="org49fd59d"><span class="section-number-3">7.2</span> make WHAT=cmd/kubectl</h3>
<div class="outline-text-3" id="text-7-2">
<p>
maybe edit the print output for fun, and see it change
</p>
</div>
</div>
</section>
<section id="outline-container-org8d49927" class="outline-2">
<h2 id="org8d49927"><span class="section-number-2">8</span> Make a KinD Cluster</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org9a9474e" class="outline-3">
<h3 id="org9a9474e"><span class="section-number-3">8.1</span> What is kind?</h3>
</div>
<div id="outline-container-org03284b0" class="outline-3">
<h3 id="org03284b0"><span class="section-number-3">8.2</span> Install Kind</h3>
</div>
<div id="outline-container-org75ea454" class="outline-3">
<h3 id="org75ea454"><span class="section-number-3">8.3</span> kind create cluster</h3>
</div>
</section>
<section id="outline-container-org8b8905b" class="outline-2">
<h2 id="org8b8905b"><span class="section-number-2">9</span> Use newly-built kubectl binary in the KinD cluster</h2>
</section>
<section id="outline-container-org8afd02b" class="outline-2">
<h2 id="org8afd02b"><span class="section-number-2">10</span> Additional Help</h2>
</section>
<section id="outline-container-org4daecf1" class="outline-2">
<h2 id="org4daecf1"><span class="section-number-2">11</span> What&rsquo;s Next?</h2>
</section>
</article>
<div id="postamble" class="status">
<p class="author">Author: ii friend</p>
<p class="date">Created: 2021-02-24 Wed 13:47</p>
</div>
</body>
</html>
